/******************************************************************************
 *
 *	開発機種			：免許証リーダ制御用アダプタ
 *	Micro-processingUnit：STM32G071GBU
 *-----------------------------------------------------------------------------
 *-----------------------------------------------------------------------------
 *	機能名称	：共通ヘッダーファイルインクルード
 *	ファイル名	：optionadapter.h
 *	ファイル説明：共通ヘッダーファイルインクルード定義
 *
 *	作成日		：2021年 X月 X日
 *	作成者		：Hayashi
 *
 *			Copyright(C)	2021 YUPITERU Ltd. All rights reserved.
 *=============================================================================
 *
 *-----------------------------------------------------------------------------
 *【 revision history 】
 *
 *	Version	：
 *	Update	：
 *	summary ：
 *	author	：
 *
 ******************************************************************************/
#ifndef	__CARDREADER__
#define	__CARDREADER__
 
 
//#include "typedefine.h"
#include "common.h"
#include "sharedbuffer.h"
#include "main.h"
#include "serial.h"
#include "ram.h"

 
 
#endif
